Тестовая_база_ERP_14/src/Enums/СпособыПолученияЗарплатыКВыплате/СпособыПолученияЗарплатыКВыплате.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыПолученияЗарплатыКВыплате</name>
  <comment>Выплата конкретного начисления, аванса или окончательная выплата зарплаты &quot;под расчет&quot;</comment>
  <enumValues>
    <name>Аванс</name>
  </enumValues>
  <enumValues>
    <name>ОтдельныйРасчет</name>
  </enumValues>
  <enumValues>
    <name>ОкончательныйРасчет</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/Enums/ХарактерВыплатыЗарплаты/ХарактерВыплатыЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ХарактерВыплатыЗарплаты</name>
  <comment>Выплата конкретного начисления, аванса или окончательная выплата зарплаты &quot;под расчет&quot;</comment>
  <enumValues>
    <name>Аванс</name>
  </enumValues>
  <enumValues>
    <name>Межрасчет</name>
  </enumValues>
  <enumValues>
    <name>Зарплата</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/Catalogs/СпособыВыплатыЗарплаты/СпособыВыплатыЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СпособыВыплатыЗарплаты</name>
  <predefined>
    <items>
      <name>Зарплата</name>
      <description>Зарплата за месяц</description>
    </items>
  </predefined>
  <attributes>
    <name>Поставляемый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактерВыплаты</name>
    <type>
      <types>EnumRef.ХарактерВыплатыЗарплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПолучения</name>
    <type>
      <types>EnumRef.СпособыПолученияЗарплатыКВыплате</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокументаОснования</name>
    <type>
      <types>EnumRef.ВидыДокументовМежрасчетныхНачислений</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаВидовДоговоров</name>
    <type>
      <types>EnumRef.ГруппыВидовДоговоровССотрудникамДляВыплатыЗарплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкончательныйРасчетНДФЛ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Округление</name>
    <type>
      <types>CatalogRef.СпособыОкругленияПриРасчетеЗарплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентВыплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьИдентификаторОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Тестовая_база_ERP_14/src/CommonModules/СпособыВыплатыЗарплатыБазовый/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Способы выплаты зарплаты.
// Процедуры и функции объекта и менеджера.
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

#Область ПервоначальноеЗаполнениеИОбновлениеИнформационнойБазы

Процедура НачальноеЗаполнение() Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ИСТИНА КАК ЗначениеИстина
	               |ИЗ
	               |	Справочник.СпособыВыплатыЗарплаты КАК СпособыВыплатыЗарплаты
	               |ГДЕ
	               |	СпособыВыплатыЗарплаты.Предопределенный = ЛОЖЬ";
				   
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда 
		Возврат;
	КонецЕсли;	
	
	СпособВыплатыСсылка = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.СпособыВыплатыЗарплаты.Зарплата");
	
	Если СпособВыплатыСсылка <> Неопределено Тогда
		
		СпособВыплатыОбъект = СпособВыплатыСсылка.ПолучитьОбъект();
		СпособВыплатыОбъект.Наименование            = НСтр("ru = 'Зарплата за месяц';
															|en = 'Salary per month'");
		СпособВыплатыОбъект.Поставляемый            = Истина;
		СпособВыплатыОбъект.СпособПолучения         = Перечисления.СпособыПолученияЗарплатыКВыплате.ОкончательныйРасчет;
		СпособВыплатыОбъект.ХарактерВыплаты         = Перечисления.ХарактерВыплатыЗарплаты.Зарплата;
		СпособВыплатыОбъект.ОкончательныйРасчетНДФЛ = Истина;
		СпособВыплатыОбъект.Записать();
		
	КонецЕсли;
	
	СпособВыплатыОбъект = Справочники.СпособыВыплатыЗарплаты.СоздатьЭлемент();
	
	СпособВыплатыОбъект.Наименование            = НСтр("ru = 'Аванс';
														|en = 'Advance'");
	СпособВыплатыОбъект.Поставляемый            = Истина;
	СпособВыплатыОбъект.СпособПолучения         = Перечисления.СпособыПолученияЗарплатыКВыплате.Аванс;
	СпособВыплатыОбъект.ХарактерВыплаты         = Перечисления.ХарактерВыплатыЗарплаты.Аванс;
	СпособВыплатыОбъект.ОкончательныйРасчетНДФЛ = Ложь;
	СпособВыплатыОбъект.Записать();
	
КонецПроцедуры

Процедура ЗаполнитьПризнакПоставляемый() Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	СпособыВыплатыЗарплаты.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.СпособыВыплатыЗарплаты КАК СпособыВыплатыЗарплаты
	               |ГДЕ
	               |	СпособыВыплатыЗарплаты.Поставляемый = ЛОЖЬ";
				   
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат;
	КонецЕсли;	
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СпособВыплатыОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Если СпособВыплатыОбъект.Предопределенный ИЛИ СпособВыплатыОбъект.Наименование = "Аванс" Тогда
			СпособВыплатыОбъект.Поставляемый = Истина;
			СпособВыплатыОбъект.Записать();
		КонецЕсли	
	КонецЦикла	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийОбъекта

Процедура ОбработкаПроверкиЗаполнения(СпособВыплаты, Отказ, ПроверяемыеРеквизиты) Экспорт
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийМенеджера

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка) Экспорт
КонецПроцедуры

#КонецОбласти

#КонецОбласти
